run/tutorial1_twisted/conjugateContactCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            buoyantPressure;
        rho             rhok;
    }

    left
    {
        type            buoyantPressure;
        rho             rhok;
    }

    right
    {
        type            buoyantPressure;
        rho             rhok;
    }

    bottom
    {
        type            buoyantPressure;
        rho             rhok;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
